# Переменная для проверки IP-адреса
variable "ip_address" {
  description = "IP-адрес"
  type        = string
  
  validation {
    condition     = can(regex("^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$", var.ip_address))
    error_message = "Значение должно быть корректным IPv4-адресом (например, 192.168.0.1)"
  }
}

# Переменная для проверки списка IP-адресов
variable "ip_list" {
  description = "Список IP-адресов"
  type        = list(string)
  
  validation {
    condition = alltrue([
      for ip in var.ip_list : can(regex("^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$", ip))
    ])
    error_message = "Все значения в списке должны быть корректными IPv4-адресами"
  }
}
